pammyleong/Arduino_AmebaD_test/AmebaPro2/Package/hardware/system/component/soc/8710c/fwlib/lib/include/rtl8710c_crypto_type.h
  struct {
    __IM  uint32_t a2eo_sum   : 11;           /*!< [10..0] sum of a2eo: header total length                                  */
  } b;                                        /*!< bit fields for crypto_ipscsr_a2eo_sum_reg */
} crypto_ipscsr_a2eo_sum_reg_t, *pcrypto_ipscsr_a2eo_sum_reg_t;

/**
 * \brief Union type to access crypto_ipscsr_enl_sum_reg (@ 0x00000024).
 */
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000024) IPSec Command/Status Register, for sum of enl              */
  
  struct {
    __IM  uint32_t enl_sum    : 24;           /*!< [23..0] sum of enl: encryption total length                               */
  } b;                                        /*!< bit fields for crypto_ipscsr_enl_sum_reg */
} crypto_ipscsr_enl_sum_reg_t, *pcrypto_ipscsr_enl_sum_reg_t;

/**
 * \brief Union type to access crypto_ipscsr_apl_sum_reg (@ 0x00000028).
 */
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000028) IPSec Command/Status Register, for sum of apl              */
  
  struct {
    __IM  uint32_t apl_sum    : 12;           /*!< [11..0] sum of apl: hash padding total length                             */
  } b;                                        /*!< bit fields for crypto_ipscsr_apl_sum_reg */
} crypto_ipscsr_apl_sum_reg_t, *pcrypto_ipscsr_apl_sum_reg_t;

/**
 * \brief Union type to access crypto_ipscsr_epl_sum_reg (@ 0x0000002C).
 */
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x0000002C) IPSec Command/Status Register, for sum of epl              */
  
  struct {
    __IM  uint32_t epl_sum    : 6;            /*!< [5..0] sum of epl: encryption padding total length                        */
  } b;                                        /*!< bit fields for crypto_ipscsr_epl_sum_reg */
} crypto_ipscsr_epl_sum_reg_t, *pcrypto_ipscsr_epl_sum_reg_t;

/**
 * \brief Union type to access crypto_ipscsr_swap_burst_reg (@ 0x00000030).
 */
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000030) IPSec Command/Status Register, for swap / burst
                                               *                  numbers
                                               */

  struct {
    __IOM uint32_t set_swap   : 1;            /*!< [0..0] Byte swap for command setting data 1: Enable 0: Disable    */
    __IOM uint32_t key_iv_swap : 1;           /*!< [1..1] Byte swap for key and iv 1: Enable 0: Disable              */
    __IOM uint32_t key_pad_swap : 1;          /*!< [2..2] Byte swap for hmac key 1: Enable 0: Disable                */
    __IOM uint32_t hash_inital_value_swap : 1;/*!< [3..3] Byte swap for sequential hash initial value 1: Enable
                                               *   0: Disable
                                               */
    __IOM uint32_t dma_in_little_endian : 1;  /*!< [4..4] Input data is little endian 1: little endian 0: big endian */

    __IM  uint32_t            : 3;
    __IOM uint32_t tx_byte_swap : 1;          /*!< [8..8] Byte swap for dma_tx engine input data 1: Enable 0: Disable */
    __IOM uint32_t data_out_little_endian : 1;/*!< [9..9] Output data is little endian 1: little endian 0: big
                                               *   endian
                                               */
    __IOM uint32_t mac_out_little_endian : 1; /*!< [10..10] Output mac is little endian 1: little endian 0: big
                                               *   endian
                                               */
    __IOM uint32_t rx_wd_swap : 1;            /*!< [11..11] Word swap for dma_rx engine input data 1: Enable 0:
                                               *   Disable
                                               */
    __IOM uint32_t tx_wd_swap : 1;            /*!< [12..12] Word swap for dma_tx engine input data 1: Enable 0:
                                               *   Disable
                                               */
    __IM  uint32_t            : 3;
    __IOM uint32_t dma_burst_length : 6;      /*!< [21..16] dma burst length Max : 32 Min: 1                         */
  } b;                                        /*!< bit fields for crypto_ipscsr_swap_burst_reg */
} crypto_ipscsr_swap_burst_reg_t, *pcrypto_ipscsr_swap_burst_reg_t;

/**
  \brief Union type to access crypto_ipscsr_engine_dbg_reg (@ 0x00000040).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000040) IPSec Command/Status Register, for engine debug            */
  
  struct {
    __IM  uint32_t engine_dbg : 32;           /*!< [31..0] Crypto engine debug values                                        */
  } b;                                        /*!< bit fields for crypto_ipscsr_engine_dbg_reg */
} crypto_ipscsr_engine_dbg_reg_t, *pcrypto_ipscsr_engine_dbg_reg_t;

/**
  \brief Union type to access crypto_ipscsr_dma_lx_dbg_reg (@ 0x00000044).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000044) IPSec Command/Status Register, for DMA lx debug            */
  
  struct {
    __IM  uint32_t dma_lx_dbg : 32;           /*!< [31..0] DMA lx debug values                                               */
  } b;                                        /*!< bit fields for crypto_ipscsr_dma_lx_dbg_reg */
} crypto_ipscsr_dma_lx_dbg_reg_t, *pcrypto_ipscsr_dma_lx_dbg_reg_t;

/**
  \brief Union type to access crypto_ipscsr_dma_rx_dbg_reg (@ 0x00000048).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000048) IPSec Command/Status Register, for DMA rx debug            */
  
  struct {
    __IM  uint32_t dma_rx_dbg : 32;           /*!< [31..0] DMA rx debug values                                               */
  } b;                                        /*!< bit fields for crypto_ipscsr_dma_rx_dbg_reg */
} crypto_ipscsr_dma_rx_dbg_reg_t, *pcrypto_ipscsr_dma_rx_dbg_reg_t;

/**
  \brief Union type to access crypto_ipscsr_dma_tx_dbg_reg (@ 0x0000004C).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x0000004C) IPSec Command/Status Register, for DMA tx debug            */
  
