pammyleong/Arduino_AmebaD_test/AmebaPro2/Package/hardware/system/component/soc/8710c/fwlib/lib/include/rtl8710c_crypto_type.h
  struct {
    __IM  uint32_t dma_tx_dbg : 32;           /*!< [31..0] DMA tx debug values                                               */
  } b;                                        /*!< bit fields for crypto_ipscsr_dma_tx_dbg_reg */
} crypto_ipscsr_dma_tx_dbg_reg_t, *pcrypto_ipscsr_dma_tx_dbg_reg_t;

/**
  \brief Union type to access crypto_ipscsr_sta_sdes_cfg_reg (@ 0x00000050).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000050) IPSec Command/Status Register, for source descriptor
                                                                  configure status                                           */
  
  struct {
    __IM  uint32_t sta_sdes_cfg : 32;         /*!< [31..0] Source descriptor configure status values                         */
  } b;                                        /*!< bit fields for crypto_ipscsr_sta_sdes_cfg_reg */
} crypto_ipscsr_sta_sdes_cfg_reg_t, *pcrypto_ipscsr_sta_sdes_cfg_reg_t;

/**
  \brief Union type to access crypto_ipscsr_sta_sdes_ptr_reg (@ 0x00000054).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000054) IPSec Command/Status Register, for source descriptor
                                                                  pointer status                                             */
  
  struct {
    __IM  uint32_t sta_sdes_ptr : 32;         /*!< [31..0] Source descriptor pointer status values                           */
  } b;                                        /*!< bit fields for crypto_ipscsr_sta_sdes_ptr_reg */
} crypto_ipscsr_sta_sdes_ptr_reg_t, *pcrypto_ipscsr_sta_sdes_ptr_reg_t;

/**
  \brief Union type to access crypto_ipscsr_sta_sdes_cmd1 (@ 0x00000058).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000058) IPSec Command/Status Register, for source descriptor
                                                                  command 1 status                                           */
  
  struct {
    __IM  uint32_t sta_sdes_cmd1 : 32;        /*!< [31..0] Source descriptor command 1 status values                         */
  } b;                                        /*!< bit fields for crypto_ipscsr_sta_sdes_cmd1 */
} crypto_ipscsr_sta_sdes_cmd1_t, *pcrypto_ipscsr_sta_sdes_cmd1_t;

/**
  \brief Union type to access crypto_ipscsr_sta_sdes_cmd2 (@ 0x0000005C).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x0000005C) IPSec Command/Status Register, for source descriptor
                                                                  command 2 status                                           */
  
  struct {
    __IM  uint32_t sta_sdes_cmd2 : 32;        /*!< [31..0] Source descriptor command 2 status values                         */
  } b;                                        /*!< bit fields for crypto_ipscsr_sta_sdes_cmd2 */
} crypto_ipscsr_sta_sdes_cmd2_t, *pcrypto_ipscsr_sta_sdes_cmd2_t;

/**
  \brief Union type to access crypto_ipscsr_sta_sdes_cmd3 (@ 0x00000060).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000060) IPSec Command/Status Register, for source descriptor
                                                                  command 3 status                                           */
  
  struct {
    __IM  uint32_t sta_sdes_cmd3 : 32;        /*!< [31..0] Source descriptor command 3 status values                         */
  } b;                                        /*!< bit fields for crypto_ipscsr_sta_sdes_cmd3 */
} crypto_ipscsr_sta_sdes_cmd3_t, *pcrypto_ipscsr_sta_sdes_cmd3_t;

/**
  \brief Union type to access crypto_ipscsr_sta_ddes_cfg_reg (@ 0x00000064).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000064) IPSec Command/Status Register, for destination
                                                                  descriptor configure status                                */
  
  struct {
    __IM  uint32_t sta_ddes_cfg : 32;         /*!< [31..0] Destination descriptor configure status values                    */
  } b;                                        /*!< bit fields for crypto_ipscsr_sta_ddes_cfg_reg */
} crypto_ipscsr_sta_ddes_cfg_reg_t, *pcrypto_ipscsr_sta_ddes_cfg_reg_t;

/**
  \brief Union type to access crypto_ipscsr_sta_ddes_ptr_reg (@ 0x00000068).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000068) IPSec Command/Status Register, for destination
                                                                  descriptor pointer status                                  */
  
  struct {
    __IM  uint32_t sta_ddes_ptr : 32;         /*!< [31..0] Destination descriptor pointer status values                      */
  } b;                                        /*!< bit fields for crypto_ipscsr_sta_ddes_ptr_reg */
} crypto_ipscsr_sta_ddes_ptr_reg_t, *pcrypto_ipscsr_sta_ddes_ptr_reg_t;

/**
 * \brief Union type to access crypto_crc_rst_reg (@ 0x00000100).
 */
typedef union {
  __OM  uint32_t w;                           /*!< (@ 0x00000100) crc reset                                          */

  struct {
    __OM  uint32_t rst        : 1;            /*!< [0..0] CRC reset                                                  */
  } b;                                        /*!< bit fields for crypto_crc_rst_reg */
} crypto_crc_rst_reg_t, *pcrypto_crc_rst_reg_t;

/**
 * \brief Union type to access crypto_crc_op_reg (@ 0x00000104).
 */
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000104) crc operation                                      */

  struct {
    __IOM uint32_t crc_iswap  : 3;            /*!< [2..0] swap input data                                            */
    __IOM uint32_t crc_oswap  : 1;            /*!< [3..3] swap output data                                           */
    __IOM uint32_t crc_sel    : 3;            /*!< [6..4] crc sel                                                    */
    __IOM uint32_t crc_dma    : 1;            /*!< [7..7] DMA mode                                                   */
    __IOM uint32_t crc_be     : 2;            /*!< [9..8] big endian                                                 */

    __IM  uint32_t            : 2;
    __IOM uint32_t crc_last   : 1;            /*!< [12..12] crc last                                                 */

    __IM  uint32_t            : 3;
    __IOM uint32_t crc_length : 16;           /*!< [31..16] length                                                   */
  } b;                                        /*!< bit fields for crypto_crc_op_reg */
} crypto_crc_op_reg_t, *pcrypto_crc_op_reg_t;

/**
 * \brief Union type to access crypto_crc_poly_reg (@ 0x00000108).
 */
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000108) CRC polynomia register                             */

