pammyleong/Arduino_AmebaD_test/AmebaPro2/Package/hardware/system/component/soc/8710c/fwlib/lib/include/rtl8710c_crypto_type.h
  struct {
    __IOM uint32_t crc_poly   : 32;           /*!< [31..0] crc polynomial coefficients                               */
  } b;                                        /*!< bit fields for crypto_crc_poly_reg */
} crypto_crc_poly_reg_t, *pcrypto_crc_poly_reg_t;

/**
 * \brief Union type to access crypto_crc_iv_reg (@ 0x0000010C).
 */
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x0000010C) CRC initial value register                         */

  struct {
    __IOM uint32_t crc_init   : 32;           /*!< [31..0] crc init value                                            */
  } b;                                        /*!< bit fields for crypto_crc_iv_reg */
} crypto_crc_iv_reg_t, *pcrypto_crc_iv_reg_t;

/**
 * \brief Union type to access crypto_crc_oxor_reg (@ 0x00000110).
 */
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000110) CRC initial value register                         */

  struct {
    __IOM uint32_t crc_oxor   : 32;           /*!< [31..0] if output xor mode                                        */
  } b;                                        /*!< bit fields for crypto_crc_oxor_reg */
} crypto_crc_oxor_reg_t, *pcrypto_crc_oxor_reg_t;

/**
 * \brief Union type to access crypto_crc_data_reg (@ 0x00000114).
 */
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000114) CRC data register                                  */

  struct {
    __IOM uint32_t crc_data   : 32;           /*!< [31..0] din - Command mode : DMA==1'b0 SDBP - Source Data Buffer
                                               *   Pointer : DMA==1'b1
                                               */
  } b;                                        /*!< bit fields for crypto_crc_data_reg */
} crypto_crc_data_reg_t, *pcrypto_crc_data_reg_t;

/**
 * \brief Union type to access crypto_crc_stat_reg (@ 0x00000118).
 */
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000118) CRC status register                                */

  struct {
    __IM  uint32_t busy       : 1;            /*!< [0..0] still busy in previous execution                           */
    __IM  uint32_t crc_ok     : 1;            /*!< [1..1] finish execution                                           */
    __IOM uint32_t crc_intr_mask : 1;         /*!< [2..2] interrupt mask                                             */
    __OM  uint32_t crc_little_endian : 1;     /*!< [3..3] little endian                                              */
  } b;                                        /*!< bit fields for crypto_crc_stat_reg */
} crypto_crc_stat_reg_t, *pcrypto_crc_stat_reg_t;

/**
 * \brief Union type to access crypto_crc_result_reg (@ 0x0000011C).
 */
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x0000011C) CRC result register                                */

  struct {
    __IM  uint32_t crc_out    : 32;           /*!< [31..0] output result                                             */
  } b;                                        /*!< bit fields for crypto_crc_result_reg */
} crypto_crc_result_reg_t, *pcrypto_crc_result_reg_t;

/**
 * \brief Union type to access crypto_crc_count_reg (@ 0x00000120).
 */
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000120) CRC count register                                 */

  struct {
    __IM  uint32_t crc_cnt    : 16;           /*!< [15..0] count number in bytes                                     */
  } b;                                        /*!< bit fields for crypto_crc_count_reg */
} crypto_crc_count_reg_t, *pcrypto_crc_count_reg_t;

/**
  \brief Union type to access crypto_crc_dma_rx_dbg_reg (@ 0x00000124).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00000124) CRC DMA rx dbg register                                    */
  
  struct {
    __IM  uint32_t crc_dma_rx_dbg : 32;       /*!< [31..0] CRC DMA rx debug values                                           */
  } b;                                        /*!< bit fields for crypto_crc_dma_rx_dbg_reg */
} crypto_crc_dma_rx_dbg_reg_t, *pcrypto_crc_dma_rx_dbg_reg_t;

/**
 * \brief Union type to access crypto_dstdesc_status_reg (@ 0x00001000).
 */
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00001000) destination descriptor status                      */

  struct {
    __IM  uint32_t fifo_empty_cnt : 8;        /*!< [7..0] Destination Descriptor FIFO empty counter                  */
    __IM  uint32_t dwptr      : 8;            /*!< [15..8] Destination Descriptor FIFO write pointer                 */
    __IM  uint32_t drptr      : 8;            /*!< [23..16] Destination Descriptor FIFO read pointer                 */
    __IOM uint32_t dst_fail   : 1;            /*!< [24..24] Destination Descriptor fail interrupt                    */

    __IM  uint32_t dst_fail_status : 2;       /*!< [26..25] Destination Descriptor fail status                       */
    __IOM uint32_t dst_fail_m : 1;            /*!< [27..27] Destination Descriptor fail interrupt mask               */

    __IM  uint32_t            : 3;
    __IOM uint32_t dst_rst    : 1;            /*!< [31..31] Destination Descriptor reset                             */
  } b;                                        /*!< bit fields for crypto_dstdesc_status_reg */
} crypto_dstdesc_status_reg_t, *pcrypto_dstdesc_status_reg_t;

/**
 * \brief Union type to access crypto_ddfw_reg (@ 0x00001004).
 */
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00001004) destination descriptor first word                  */

  struct {
    __IOM uint32_t ddfw       : 32;           /*!< [31..0] IPSec Destination Descriptor first word                   */
  } b;                                        /*!< bit fields for crypto_ddfw_reg */
} crypto_ddfw_reg_t, *pcrypto_ddfw_reg_t;

/**
 * \brief Union type to access crypto_ddsw_reg (@ 0x00001008).
 */
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x00001008) destination descriptor second word                 */

