pammyleong/Arduino_AmebaD_test/AmebaPro2/Package/hardware/system/component/soc/8710c/fwlib/lib/include/rtl8710c_crypto_type.h
  struct {
    __IOM uint32_t ddsw       : 32;           /*!< [31..0] IPSec Destination Descriptor second word                  */
  } b;                                        /*!< bit fields for crypto_ddsw_reg */
} crypto_ddsw_reg_t, *pcrypto_ddsw_reg_t;

/**
 * \brief Union type to access crypto_desc_pkt_conf_reg (@ 0x0000100C).
 */
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x0000100C) descriptor packet setting                          */

  struct {
    __IOM uint32_t dbg_sptr   : 8;            /*!< [7..0] Source Descriptor FIFO empty counter                       */
    __IOM uint32_t dbg_dptr   : 8;            /*!< [15..8] Destination Descriptor FIFO write pointer                 */

    __IM  uint32_t pk_arbiter : 2;            /*!< [17..16] Packet arbiter 2'd0 : bus1, 2'd1 : bus2, 2'd2 : bus3     */
    __IM  uint32_t            : 6;
    __IOM uint32_t bus1_priority_th : 2;      /*!< [25..24] Bus1 priority threshold                                  */
    __IOM uint32_t bus2_priority_th : 2;      /*!< [27..26] Bus2 priority threshold                                  */
    __IOM uint32_t bus3_priority_th : 2;      /*!< [29..28] Bus3 priority threshold                                  */
    __IOM uint32_t pk_arbiter_mode : 2;       /*!< [31..30] Packet arbiter mode                                      */
  } b;                                        /*!< bit fields for crypto_desc_pkt_conf_reg */
} crypto_desc_pkt_conf_reg_t, *pcrypto_desc_pkt_conf_reg_t;

/** @} */ /* End of group hs_hal_crypto_reg */
/// @endcond /* End of condition DOXYGEN_GENERAL_REG_TYPE || DOXYGEN_CRYPTO_REG_TYPE */


#ifdef  __cplusplus
}
#endif

#endif    // end of #ifndef _RTL8710C_CRYPTO_CRYPTO_TYPE_H_

